{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_1", "config": {"trainable": true, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 512, "name": "dense_1"}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "config": {"seed": null, "name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "config": {"trainable": true, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 512, "name": "dense_2"}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_2", "config": {"seed": null, "name": "dropout_2", "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_3", "config": {"trainable": true, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 10, "name": "dense_3"}}], "output_layers": [["dense_3", 0, 0]]}}